ishotjr/WhenDi/spi/spi_mk64f.c
/**
 ******************************************************************************
 * @file    atmo_spi.c
 * @author  
 * @version 
 * @date    
 * @brief   Atmosphere API - SPI source file for MCUXpresso SDK
 ******************************************************************************
 * @attention
 *
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "fsl_dspi.h"
#include "fsl_port.h"
#include "fsl_gpio.h"

#include "spi.h"
#include "spi_mk64f.h"
#include <stdlib.h>

const ATMO_SPI_DriverInstance_t MK64FSPIDriverInstance = {
	ATMO_MK64F_SPI_Init,
	ATMO_MK64F_SPI_DeInit,
	ATMO_MK64F_SPI_SetConfiguration,
	ATMO_MK64F_SPI_GetConfiguration,
	ATMO_MK64F_SPI_Master_SetDeviceConfiguration,
	ATMO_MK64F_SPI_Master_GetDeviceConfiguration,
	ATMO_MK64F_SPI_Master_RegisterCallback,
	ATMO_MK64F_SPI_Slave_RegisterCallback,
	ATMO_MK64F_SPI_Master_AssertSlaveSelect,
	ATMO_MK64F_SPI_Master_DeAssertSlaveSelect,
	ATMO_MK64F_SPI_Master_Write,
	ATMO_MK64F_SPI_Master_WriteNonBlocking,
	ATMO_MK64F_SPI_Master_Read,
	ATMO_MK64F_SPI_Master_ReadNonBlocking,
	ATMO_MK64F_SPI_Slave_WaitForReceive
};



/* Imported function prototypes ----------------------------------------------*/
extern uint32_t DSPI_GetInstance(SPI_Type *base);


/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/
#define ATMO_SPI_DEFAULT_OPERATING_MODE        ATMO_SPI_OperatingMode_Uninitialized
#define ATMO_SPI_DEFAULT_BAUDRATE              1000000u
#define ATMO_SPI_DEFAULT_CLOCK_MODE            ATMO_SPI_ClockMode_0
#define ATMO_SPI_DEFAULT_CLOCK_IS_CONTINUOUS   false
#define ATMO_SPI_DEFAULT_MSB_FIRST             true
#define ATMO_SPI_DEFAULT_SS_ACTIVE_LOW         true
#define ATMO_SPI_DEFAULT_SS_IS_CONTINUOUS      true
#define ATMO_SPI_DEFAULT_SLAVE_BUFFER_SIZE     32u



/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
static PORT_Type *portBase[] = PORT_BASE_PTRS;
static GPIO_Type *gpioBase[] = GPIO_BASE_PTRS;
static SPI_Type *peripheralBase[] = SPI_BASE_PTRS;
static dspi_master_handle_t *masterHandle[3];
static dspi_slave_handle_t *slaveHandle[3];
static ATMO_SPI_Peripheral_t ATMO_Platform_SPI_Peripheral[3];

static ATMO_SPI_SlaveTransfer_t *slaveXfer[3];
static uint8_t *slaveBuffer[3];


/* Private functions ---------------------------------------------------------*/

/**
 * This routine converts the status values from platform type to Atmosphere API type.
 *
 * @param status :The platform status.
 * @return Status as Atmosphere API type.
 */
static ATMO_SPI_Status_t ATMO_Platform_SPI_Convert_Status_PlatformToAtmo(status_t status)
{
	ATMO_SPI_Status_t returnStatus;

	switch (status)
	{
		case kStatus_Success :
			returnStatus = ATMO_SPI_Status_Success;
			break;
		case kStatus_Fail :
		case kStatus_DSPI_Error :
			returnStatus = ATMO_SPI_Status_Fail;
			break;
		case kStatus_Timeout :
			returnStatus = ATMO_SPI_Status_Timeout;
			break;
		case kStatus_DSPI_Busy :
			returnStatus = ATMO_SPI_Status_Busy;
			break;
		case kStatus_DSPI_Idle :
			returnStatus = ATMO_SPI_Status_Idle;
			break;
		default :
			returnStatus = ATMO_SPI_Status_Unknown;
			break;
	}

	return returnStatus;
}

/**
 * This routine determines the PCS number based on the SS pin and peripheral instance.
 *
 * @param instance :The SPI peripheral instance.
 * @param ssPin :The SPI Slave Select pin.
 * @return PCS as an integer.
 */
static int8_t ATMO_Platform_SPI_GetPcs(uint32_t instance, ATMO_SPI_CS_t ssPin)
{
	if(ssPin < 0)
	{
		return 0;
	}

	uint8_t portNum = (uint8_t)((ssPin >> 8) & 0xFF);
	uint8_t pinNum = (uint8_t)((ssPin >> 0) & 0xFF);
	port_mux_t portMux = (port_mux_t)((portBase[portNum]->PCR[pinNum] & PORT_PCR_MUX_MASK) >> PORT_PCR_MUX_SHIFT);

	return 	((instance == 0) && (portNum == 0) && (pinNum == 14) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 0) && (portNum == 1) && (pinNum == 23) && (portMux == kPORT_MuxAlt3)) ? 5 :
			((instance == 0) && (portNum == 2) && (pinNum ==  0) && (portMux == kPORT_MuxAlt2)) ? 4 :
			((instance == 0) && (portNum == 2) && (pinNum ==  1) && (portMux == kPORT_MuxAlt2)) ? 3 :
			((instance == 0) && (portNum == 2) && (pinNum ==  2) && (portMux == kPORT_MuxAlt2)) ? 2 :
			((instance == 0) && (portNum == 2) && (pinNum ==  3) && (portMux == kPORT_MuxAlt2)) ? 1 :
			((instance == 0) && (portNum == 2) && (pinNum ==  4) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 0) && (portNum == 3) && (pinNum ==  0) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 0) && (portNum == 3) && (pinNum ==  4) && (portMux == kPORT_MuxAlt2)) ? 1 :
			((instance == 0) && (portNum == 3) && (pinNum ==  5) && (portMux == kPORT_MuxAlt2)) ? 2 :
			((instance == 0) && (portNum == 3) && (pinNum ==  6) && (portMux == kPORT_MuxAlt2)) ? 3 :
			((instance == 1) && (portNum == 1) && (pinNum ==  9) && (portMux == kPORT_MuxAlt2)) ? 1 :
			((instance == 1) && (portNum == 1) && (pinNum == 10) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 1) && (portNum == 3) && (pinNum ==  4) && (portMux == kPORT_MuxAlt7)) ? 0 :
			((instance == 1) && (portNum == 4) && (pinNum ==  0) && (portMux == kPORT_MuxAlt2)) ? 1 :
			((instance == 1) && (portNum == 4) && (pinNum ==  4) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 1) && (portNum == 4) && (pinNum ==  5) && (portMux == kPORT_MuxAlt2)) ? 2 :
			((instance == 1) && (portNum == 4) && (pinNum ==  6) && (portMux == kPORT_MuxAlt2)) ? 3 :
			((instance == 2) && (portNum == 1) && (pinNum == 20) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 2) && (portNum == 3) && (pinNum == 11) && (portMux == kPORT_MuxAlt2)) ? 0 :
			((instance == 2) && (portNum == 3) && (pinNum == 15) && (portMux == kPORT_MuxAlt2)) ? 1 :
			-1;
}

/**
 * This routine is the callback function for the platform in master mode.
 *
 * @param base :The pointer to the SPI peripheral base.
 * @param handle :The pointer to the master handle structure.
 * @param status :The status of the transfer.
 * @param userData :The pointer to user defined data.
 * @return None.
 */
static void ATMO_Platform_SPI_Master_Callback(SPI_Type *base, dspi_master_handle_t *handle, status_t status, void *userData)
{
	ATMO_SPI_MasterTransfer_t masterXfer;
	uint32_t instance = DSPI_GetInstance(base);
	ATMO_SPI_Master_Callback_t callback = ATMO_Platform_SPI_Peripheral[instance].cbFunc;

	masterXfer.event = ATMO_SPI_MasterEvent_Complete;
	masterXfer.data = handle->txData;
	masterXfer.dataSize = handle->totalByteCount - handle->remainingSendByteCount;

