ishotjr/WhenDi/spi/spi_mk64f.c
	callback(&masterXfer, userData);
}

/**
 * This routine is the callback function for the platform in slave mode.
 *
 * @param base :The pointer to the SPI peripheral base.
 * @param handle :The pointer to the slave handle structure.
 * @param status :The status of the transfer.
 * @param userData :The pointer to user defined data.
 * @return None.
 */
static void ATMO_Platform_SPI_Slave_Callback(SPI_Type *base, dspi_slave_handle_t *handle, status_t status, void *userData)
{
	uint32_t instance = DSPI_GetInstance(base);
	ATMO_SPI_Slave_Callback_t callback = ATMO_Platform_SPI_Peripheral[instance].cbFunc;
	dspi_transfer_t transfer;

    if (status == kStatus_Success)
    {
        slaveXfer[instance]->data = slaveBuffer[instance];
        slaveXfer[instance]->dataSize = handle->totalByteCount - handle->remainingReceiveByteCount;
        slaveXfer[instance]->transferComplete = true;
        slaveXfer[instance]->event = ATMO_SPI_SlaveEvent_Complete;
        callback(slaveXfer[instance], userData);
    }

	// setup the SPI peripheral to start receiving data again
	transfer.txData = slaveXfer[instance]->data;
	transfer.rxData = slaveBuffer[instance];
	transfer.dataSize = slaveXfer[instance]->dataSize;
	transfer.configFlags = kDSPI_SlaveCtar0;
	DSPI_SlaveTransferNonBlocking(peripheralBase[instance], slaveHandle[instance], &transfer);
}

/**
 * This routine performs the data transfer (write or read) in master mode.
 *
 * @param read :Specifies whether the operation is a write or read.
 * @param blocking :Specifies whether the function should wait until the transfer is complete before returning (blocking) or if it should return immediately (non-blocking)
 * @param instance :The peripheral instance used for writing/reading the specified slave device.
 * @param slaveAddress :The SPI address of the slave device.
 * @param cmdBytes :The pointer to a buffer holding the command that will be sent by the SPI peripheral. May be NULL.
 * @param numCmdBytes :The number of bytes in the cmdBytes buffer that will be sent by the SPI peripheral. May be 0.
 * @param dataBytes :The pointer to a buffer for holding/storing the data bytes that will be transfered to/from the SPI peripheral.
 * @param numDataBytes :The number of bytes to be transferred.
 * @return status.
 */
static ATMO_SPI_Status_t ATMO_Platform_SPI_Master_Transfer(ATMO_DriverInstanceData_t *driverInstance, bool read, bool blocking, uint32_t instance, ATMO_SPI_CS_t ssPin, const uint8_t *cmdBytes, uint16_t numCmdBytes, uint8_t *dataBytes, uint16_t numDataBytes)
{
	
	uint8_t portNum = ssPin >= 0 ?(uint8_t)((ssPin >> 8) & 0xFF) : 0;
	uint8_t pinNum = ssPin >=0 ? (uint8_t)((ssPin >> 0) & 0xFF) : 0;
	port_mux_t portMux = ssPin >= 0 ? (port_mux_t)((portBase[portNum]->PCR[pinNum] & PORT_PCR_MUX_MASK) >> PORT_PCR_MUX_SHIFT) : kPORT_MuxAsGpio;
	status_t platformStatus = kStatus_Fail;
	dspi_transfer_t masterStructure;
	uint8_t *txData;
	bool isPcsPinGpio = false;
	int8_t pcs;

	if (instance > 2)
		return ATMO_SPI_Status_NotSupported;

	if(masterHandle[instance] == NULL)
		return ATMO_SPI_Status_Invalid;

	if (ATMO_Platform_SPI_Peripheral[instance].operatingMode == ATMO_SPI_OperatingMode_Slave)
		return ATMO_SPI_Status_Invalid;

	if ((dataBytes == NULL) || (numDataBytes == 0))
		return ATMO_SPI_Status_Invalid;

	if (portMux == kPORT_PinDisabledOrAnalog)
		return ATMO_SPI_Status_Invalid;

	masterStructure.configFlags = 0;

	if (portMux == kPORT_MuxAsGpio)
	{
		isPcsPinGpio = true;
	}
	else
	{
		pcs = ATMO_Platform_SPI_GetPcs(instance, ssPin);

		// Select which PCS to use
		if (pcs >= 0)
			masterStructure.configFlags |= (pcs << DSPI_MASTER_PCS_SHIFT);
		else
			return ATMO_SPI_Status_Invalid;

		// Configure PCS continuous/pulsed mode
		if (ATMO_Platform_SPI_Peripheral[instance].deviceConfig.ssContinuous)
			masterStructure.configFlags |= kDSPI_MasterPcsContinuous;
		else
			masterStructure.configFlags &= ~kDSPI_MasterPcsContinuous;
	}

	bool mallocTx = false;

	if (read)
	{
		masterStructure.txData = (uint8_t *)cmdBytes;
		masterStructure.dataSize = numCmdBytes + numDataBytes;
		masterStructure.rxData = dataBytes;
	}
	else if (numCmdBytes !=0)
	{
		mallocTx = true;
		txData = ATMO_Malloc(numCmdBytes + numDataBytes);

		memcpy(txData, cmdBytes, numCmdBytes);
		memcpy(txData+numCmdBytes, dataBytes, numDataBytes);

		masterStructure.txData = txData;
		masterStructure.dataSize = numCmdBytes + numDataBytes;
		masterStructure.rxData = NULL;
	}
	else
	{
		masterStructure.txData = dataBytes;
		masterStructure.dataSize = numDataBytes;
		masterStructure.rxData = NULL;
	}

	if (isPcsPinGpio && (ssPin >= 0))
		ATMO_MK64F_SPI_Master_AssertSlaveSelect(driverInstance, ssPin, ATMO_Platform_SPI_Peripheral[instance].deviceConfig.ssActiveLow);

	if (blocking)
		platformStatus = DSPI_MasterTransferBlocking(peripheralBase[instance], &masterStructure);
	else
		platformStatus = DSPI_MasterTransferNonBlocking(peripheralBase[instance], masterHandle[instance], &masterStructure);

	if (isPcsPinGpio && (ssPin >= 0))
		ATMO_MK64F_SPI_Master_DeAssertSlaveSelect(driverInstance, ssPin, ATMO_Platform_SPI_Peripheral[instance].deviceConfig.ssActiveLow);

	if (mallocTx)
		ATMO_Free(txData);

	return ATMO_Platform_SPI_Convert_Status_PlatformToAtmo(platformStatus);
}

ATMO_Status_t ATMO_MK64F_SPI_AddDriverInstance(ATMO_DriverInstanceHandle_t *instanceNumber)
{
	ATMO_Status_t status = ATMO_Status_Success;

	for( int i = 0; (i < 3) && (status == ATMO_Status_Success); i++ )
	{
		ATMO_DriverInstanceData_t *instance = ATMO_Malloc(sizeof(ATMO_SPI_DriverInstance_t));

		uint32_t *spiPeriphNum = ATMO_Malloc(sizeof(uint32_t));
		*spiPeriphNum = i;

		instance->name = "MK64F SPI";
		instance->initialized = false;
		instance->instanceNumber = *instanceNumber;
		instance->argument = spiPeriphNum;

		status = ATMO_SPI_AddDriverInstance(&MK64FSPIDriverInstance, instance, instanceNumber);
	
	}

	return status;
}


/* Exported functions ---------------------------------------------------------*/

/**
 *  ATMO_SPI_Init
 *
 *    @param instance
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Init(ATMO_DriverInstanceData_t *instance)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	ATMO_SPI_Peripheral_t config;

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	config.operatingMode = ATMO_SPI_OperatingMode_Master;
	config.cbFunc = NULL;
	config.cbParam = NULL;
	config.deviceConfig.baudRate = 2000000;
	config.deviceConfig.clockContinuous = false;
	config.deviceConfig.clockMode = ATMO_SPI_ClockMode_0;
	config.deviceConfig.msbFirst = true;
	config.deviceConfig.ssActiveLow = true;
	config.deviceConfig.ssContinuous = false;

	return ATMO_MK64F_SPI_SetConfiguration(instance, &config);
}

/**
 *  ATMO_SPI_DeInit
 *
 *    @param instance
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_DeInit(ATMO_DriverInstanceData_t *instance)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	ATMO_Platform_SPI_Peripheral[spiPeriphNum].cbFunc = NULL;

	if ((masterHandle[spiPeriphNum] != NULL) || (slaveHandle[spiPeriphNum] != NULL))
		DSPI_Deinit(peripheralBase[spiPeriphNum]);

	if (masterHandle[spiPeriphNum] != NULL)
		ATMO_Free(masterHandle[spiPeriphNum]);

