ishotjr/WhenDi/spi/spi_mk64f.c
	if (slaveHandle[spiPeriphNum] != NULL)
		ATMO_Free(slaveHandle[spiPeriphNum]);

	if (slaveXfer[spiPeriphNum] != NULL)
		ATMO_Free(slaveXfer[spiPeriphNum]);

	if (slaveBuffer[spiPeriphNum] != NULL)
		ATMO_Free(slaveBuffer[spiPeriphNum]);

	return ATMO_SPI_Status_Success;
}

/**
 *  ATMO_SPI_Init
 *
 *    @param instance
 *    @param config
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_SetConfiguration(ATMO_DriverInstanceData_t *instance, const ATMO_SPI_Peripheral_t *config)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

    if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	if (config == NULL)
		return ATMO_SPI_Status_Invalid;

	if ((masterHandle[spiPeriphNum] != NULL) || (slaveHandle[spiPeriphNum]) != NULL)
		return ATMO_SPI_Status_Initialized;

	if (config->operatingMode == ATMO_SPI_OperatingMode_Master)
	{
		clock_name_t clockSource;
	    dspi_master_config_t masterConfig;

	    // Start with the default config settings
	    DSPI_MasterGetDefaultConfig(&masterConfig);

	    switch (config->deviceConfig.clockMode)
	    {
	    	default :
			case ATMO_SPI_ClockMode_0 :
			    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveHigh;
				masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseFirstEdge;
				break;
			case ATMO_SPI_ClockMode_1 :
			    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveHigh;
				masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseSecondEdge;
				break;
			case ATMO_SPI_ClockMode_2 :
			    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveLow;
				masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseFirstEdge;
				break;
			case ATMO_SPI_ClockMode_3 :
			    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveLow;
				masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseSecondEdge;
				break;
	    }

	    masterConfig.enableContinuousSCK = config->deviceConfig.clockContinuous;
	    masterConfig.ctarConfig.baudRate = config->deviceConfig.baudRate;
		masterConfig.ctarConfig.direction = (config->deviceConfig.msbFirst) ? kDSPI_MsbFirst : kDSPI_LsbFirst;
	    masterConfig.pcsActiveHighOrLow = (config->deviceConfig.ssActiveLow) ? kDSPI_PcsActiveLow : kDSPI_PcsActiveHigh;
	    masterConfig.whichPcs = kDSPI_Pcs0;

	    switch (spiPeriphNum)
	    {
			case 0 :
				clockSource = DSPI0_CLK_SRC;
				break;
			case 1 :
				clockSource = DSPI1_CLK_SRC;
				break;
			case 2 :
				clockSource = DSPI2_CLK_SRC;
				break;
			default :
				clockSource = BUS_CLK;
				break;
	    }

	    DSPI_MasterInit(peripheralBase[spiPeriphNum], &masterConfig, CLOCK_GetFreq(clockSource));
	    masterHandle[spiPeriphNum] = (dspi_master_handle_t *) ATMO_Malloc(sizeof(dspi_master_handle_t));
	    DSPI_MasterTransferCreateHandle(peripheralBase[spiPeriphNum], masterHandle[spiPeriphNum], &ATMO_Platform_SPI_Master_Callback, config->cbParam);
	}
	else if (config->operatingMode == ATMO_SPI_OperatingMode_Slave)
	{
	    dspi_slave_config_t slaveConfig;

	    DSPI_SlaveGetDefaultConfig(&slaveConfig);

	    switch (config->deviceConfig.clockMode)
	    {
	    	default :
			case ATMO_SPI_ClockMode_0 :
				slaveConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveHigh;
				slaveConfig.ctarConfig.cpha = kDSPI_ClockPhaseFirstEdge;
				break;
			case ATMO_SPI_ClockMode_1 :
				slaveConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveHigh;
				slaveConfig.ctarConfig.cpha = kDSPI_ClockPhaseSecondEdge;
				break;
			case ATMO_SPI_ClockMode_2 :
				slaveConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveLow;
				slaveConfig.ctarConfig.cpha = kDSPI_ClockPhaseFirstEdge;
				break;
			case ATMO_SPI_ClockMode_3 :
				slaveConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveLow;
				slaveConfig.ctarConfig.cpha = kDSPI_ClockPhaseSecondEdge;
				break;
	    }

	    slaveConfig.enableContinuousSCK = config->deviceConfig.clockContinuous;

	    DSPI_SlaveInit(peripheralBase[spiPeriphNum], &slaveConfig);
	    slaveHandle[spiPeriphNum] = (dspi_slave_handle_t *) ATMO_Malloc(sizeof(dspi_slave_handle_t));
	    DSPI_SlaveTransferCreateHandle(peripheralBase[spiPeriphNum], slaveHandle[spiPeriphNum], &ATMO_Platform_SPI_Slave_Callback, config->cbParam);

	    slaveXfer[spiPeriphNum] = (ATMO_SPI_SlaveTransfer_t *) ATMO_Malloc(sizeof(ATMO_SPI_SlaveTransfer_t));
	    slaveBuffer[spiPeriphNum] = (uint8_t *) ATMO_Malloc(config->bufferSize);

	    slaveXfer[spiPeriphNum]->data = NULL;
	    slaveXfer[spiPeriphNum]->dataSize = 0;
	    slaveXfer[spiPeriphNum]->transferComplete = false;
	    slaveXfer[spiPeriphNum]->event = ATMO_SPI_SlaveEvent_Unknown;
	}
	else // invalid (should never get here)
	{
		return ATMO_SPI_Status_Invalid;
	}

	// Make a copy of the config structure in the peripheral config array.
	memcpy(&ATMO_Platform_SPI_Peripheral[spiPeriphNum], config, sizeof(ATMO_SPI_Peripheral_t));

	return ATMO_SPI_Status_Success;
}

/**
 *  ATMO_SPI_GetConfiguration
 *
 *    @param instance
 *    @param config
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_GetConfiguration(ATMO_DriverInstanceData_t *instance, ATMO_SPI_Peripheral_t *config)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

    memcpy(config, &ATMO_Platform_SPI_Peripheral[spiPeriphNum], sizeof(ATMO_SPI_Peripheral_t));

	return ATMO_SPI_Status_Success;
}

/**
 *  ATMO_SPI_Master_SetDeviceConfiguration
 *
 *    @param instance
 *    @param ssPin
 *    @param config
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_SetDeviceConfiguration(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, const ATMO_SPI_Device_t *config)
{
	clock_name_t clockSource;
    dspi_master_config_t masterConfig;
	uint32_t tempVar;

	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	uint8_t pcs = ATMO_Platform_SPI_GetPcs(spiPeriphNum, ssPin);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

    switch (config->clockMode)
    {
    	default :
		case ATMO_SPI_ClockMode_0 :
		    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveHigh;
			masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseFirstEdge;
			break;
		case ATMO_SPI_ClockMode_1 :
		    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveHigh;
			masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseSecondEdge;
			break;
		case ATMO_SPI_ClockMode_2 :
		    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveLow;
			masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseFirstEdge;
			break;
		case ATMO_SPI_ClockMode_3 :
		    masterConfig.ctarConfig.cpol = kDSPI_ClockPolarityActiveLow;
			masterConfig.ctarConfig.cpha = kDSPI_ClockPhaseSecondEdge;
			break;
    }

