ishotjr/WhenDi/spi/spi_mk64f.c
    masterConfig.enableContinuousSCK = config->clockContinuous;
    masterConfig.ctarConfig.baudRate = config->baudRate;
	masterConfig.ctarConfig.direction = (config->msbFirst) ? kDSPI_MsbFirst : kDSPI_LsbFirst;
    masterConfig.pcsActiveHighOrLow = (config->ssActiveLow) ? kDSPI_PcsActiveLow : kDSPI_PcsActiveHigh;

    switch (spiPeriphNum)
    {
		case 0 :
			clockSource = DSPI0_CLK_SRC;
			break;
		case 1 :
			clockSource = DSPI1_CLK_SRC;
			break;
		case 2 :
			clockSource = DSPI2_CLK_SRC;
			break;
		default :
			clockSource = BUS_CLK;
			break;
    }

    // halt SPI peripheral
    DSPI_StopTransfer(peripheralBase[spiPeriphNum]);

	if(ssPin >= 0)
	{
		// update continuous clock and pcs level settings
		tempVar = peripheralBase[spiPeriphNum]->MCR & ~(SPI_MCR_CONT_SCKE_MASK | SPI_MCR_PCSIS(1 << pcs));
		tempVar |= SPI_MCR_CONT_SCKE(masterConfig.enableContinuousSCK) | SPI_MCR_PCSIS(masterConfig.pcsActiveHighOrLow << pcs);
		peripheralBase[spiPeriphNum]->MCR = tempVar;
	}

    // update lsb_first and clock polarity/phase settings
    tempVar = peripheralBase[spiPeriphNum]->CTAR[kDSPI_Ctar0] & ~(SPI_CTAR_CPOL_MASK | SPI_CTAR_CPHA_MASK | SPI_CTAR_LSBFE_MASK);
    tempVar |= SPI_CTAR_CPOL(masterConfig.ctarConfig.cpol) | SPI_CTAR_CPHA(masterConfig.ctarConfig.cpha) | SPI_CTAR_LSBFE(masterConfig.ctarConfig.direction);
    peripheralBase[spiPeriphNum]->CTAR[kDSPI_Ctar0] = tempVar;

	// update baud rate (this takes a long time so skip if it's not changing)
    if (masterConfig.ctarConfig.baudRate != ATMO_Platform_SPI_Peripheral[spiPeriphNum].deviceConfig.baudRate)
    	tempVar = DSPI_MasterSetBaudRate(peripheralBase[spiPeriphNum], kDSPI_Ctar0, masterConfig.ctarConfig.baudRate, CLOCK_GetFreq(clockSource));
    else
        tempVar = masterConfig.ctarConfig.baudRate;

    // resume SPI peripheral
    DSPI_StartTransfer(peripheralBase[spiPeriphNum]);

    memcpy(&ATMO_Platform_SPI_Peripheral[spiPeriphNum].deviceConfig, config, sizeof(ATMO_SPI_Device_t));

    // update with actual calculated baud rate
    ATMO_Platform_SPI_Peripheral[spiPeriphNum].deviceConfig.baudRate = tempVar;

	return ATMO_SPI_Status_Success;
}

/**
 *  ATMO_SPI_Master_GetDeviceConfiguration
 *
 *    @param instance
 *    @param config
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_GetDeviceConfiguration(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, ATMO_SPI_Device_t *config)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

    memcpy(config, &ATMO_Platform_SPI_Peripheral[spiPeriphNum].deviceConfig, sizeof(ATMO_SPI_Device_t));

	return ATMO_SPI_Status_Success;
}

/**
 *  AIR_SPI_RegisterMasterCallback
 *
 *    @param instance
 *    @param cbFunc
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_RegisterCallback(ATMO_DriverInstanceData_t *instance, ATMO_SPI_Master_Callback_t cbFunc)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	if (cbFunc == NULL)
		return ATMO_SPI_Status_Invalid;

	if (ATMO_Platform_SPI_Peripheral[spiPeriphNum].operatingMode != ATMO_SPI_OperatingMode_Master)
		return ATMO_SPI_Status_Invalid;

	ATMO_Platform_SPI_Peripheral[spiPeriphNum].cbFunc = (ATMO_SPI_Master_Callback_t)cbFunc;

	return ATMO_SPI_Status_Success;
}

/**
 *  AIR_SPI_RegisterSlaveCallback
 *
 *    @param instance
 *    @param cbFunc
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Slave_RegisterCallback(ATMO_DriverInstanceData_t *instance, ATMO_SPI_Slave_Callback_t cbFunc)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	if (cbFunc == NULL)
		return ATMO_SPI_Status_Invalid;

	if (ATMO_Platform_SPI_Peripheral[spiPeriphNum].operatingMode != ATMO_SPI_OperatingMode_Slave)
		return ATMO_SPI_Status_Invalid;

	ATMO_Platform_SPI_Peripheral[spiPeriphNum].cbFunc = (ATMO_SPI_Slave_Callback_t)cbFunc;

	return ATMO_SPI_Status_Success;
}

/**
 *  ATMO_SPI_Master_Assert_SlaveSelect
 *
 *    @param ssPin
 *    @param ssActiveLow
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_AssertSlaveSelect(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, bool ssActiveLow)
{
	if(ssPin < 0)
	{
		return ATMO_SPI_Status_Success;
	}

	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	uint8_t portNum = (uint8_t)((ssPin >> 8) & 0xFF);
	uint8_t pinNum = (uint8_t)((ssPin >> 0) & 0xFF);
	uint8_t value = (ssActiveLow) ? 0 : 1;

	// Check if pin is configured as an output
	if (!(gpioBase[portNum]->PDDR & (1 << pinNum)))
		return ATMO_SPI_Status_Invalid;

	GPIO_WritePinOutput(gpioBase[portNum], pinNum, value);

	return ATMO_SPI_Status_Success;
}

/**
 *  ATMO_SPI_Master_DeAssert_SlaveSelect
 *
 *    @param ssPin
 *    @param ssActiveLow
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_DeAssertSlaveSelect(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, bool ssActiveLow)
{
	if(ssPin < 0)
	{
		return ATMO_SPI_Status_Success;
	}
	
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	return ATMO_MK64F_SPI_Master_AssertSlaveSelect(instance, ssPin, !ssActiveLow);
}

/**
 *  ATMO_SPI_Master_Write
 *
 *    @param instance
 *    @param ssPin
 *    @param cmdBytes
 *    @param numCmdBytes
 *    @param writeBytes
 *    @param numWriteBytes
 *    @param timeout_ms
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_Write(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, const uint8_t* cmdBytes, uint16_t numCmdBytes, const uint8_t* writeBytes, uint16_t numWriteBytes, uint16_t timeout_ms)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	return ATMO_Platform_SPI_Master_Transfer(instance, false, true, spiPeriphNum, ssPin, cmdBytes, numCmdBytes, (uint8_t *)writeBytes, numWriteBytes);
}

/**
 *  ATMO_SPI_Master_Write_NonBlocking
 *
 *    @param instance
 *    @param ssPin
 *    @param cmdBytes
 *    @param numCmdBytes
 *    @param writeBytes
 *    @param numWriteBytes
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_WriteNonBlocking(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, const uint8_t* cmdBytes, uint16_t numCmdBytes, const uint8_t* writeBytes, uint16_t numWriteBytes)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

