ishotjr/WhenDi/spi/spi_mk64f.c
	return ATMO_Platform_SPI_Master_Transfer(instance, false, false, spiPeriphNum, ssPin, cmdBytes, numCmdBytes, (uint8_t *)writeBytes, numWriteBytes);
}

/**
 *  ATMO_SPI_Master_Read
 *
 *    @param instance
 *    @param ssPin
 *    @param cmdBytes
 *    @param numCmdBytes
 *    @param readBytes
 *    @param numReadBytes
 *    @param timeout_ms
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_Read(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, const uint8_t *cmdBytes, uint16_t numCmdBytes, uint8_t *readBytes, uint16_t numReadBytes, uint16_t timeout_ms)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	return ATMO_Platform_SPI_Master_Transfer(instance, true, true, spiPeriphNum, ssPin, cmdBytes, numCmdBytes, readBytes, numReadBytes);
}

/**
 *  ATMO_SPI_Master_Read
 *
 *    @param instance
 *    @param ssPin
 *    @param cmdBytes
 *    @param numCmdBytes
 *    @param readBytes
 *    @param numReadBytes
 */
ATMO_SPI_Status_t ATMO_MK64F_SPI_Master_ReadNonBlocking(ATMO_DriverInstanceData_t *instance, ATMO_SPI_CS_t ssPin, const uint8_t *cmdBytes, uint16_t numCmdBytes, uint8_t *readBytes, uint16_t numReadBytes)
{
	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	return ATMO_Platform_SPI_Master_Transfer(instance, true, false, spiPeriphNum, ssPin, cmdBytes, numCmdBytes, readBytes, numReadBytes);
}

ATMO_SPI_Status_t ATMO_MK64F_SPI_Slave_WaitForReceive(ATMO_DriverInstanceData_t *instance, uint16_t xferSize)
{
	status_t platformStatus = kStatus_Fail;
	dspi_transfer_t transfer;

	uint32_t spiPeriphNum = *((uint32_t *)instance->argument);

	if (spiPeriphNum > 2)
		return ATMO_SPI_Status_NotSupported;

	if(slaveHandle[spiPeriphNum] == NULL)
		return ATMO_SPI_Status_Invalid;

	if (ATMO_Platform_SPI_Peripheral[spiPeriphNum].operatingMode != ATMO_SPI_OperatingMode_Slave)
		return ATMO_SPI_Status_Invalid;

	transfer.txData = NULL;
	transfer.rxData = slaveBuffer[spiPeriphNum];
	transfer.dataSize = xferSize;
	transfer.configFlags = kDSPI_SlaveCtar0;

	platformStatus = DSPI_SlaveTransferNonBlocking(peripheralBase[spiPeriphNum], slaveHandle[spiPeriphNum], &transfer);

	return ATMO_Platform_SPI_Convert_Status_PlatformToAtmo(platformStatus);
}
